CSI API ETABS v1
cDiaphragm.SetDiaphragm Method
 Adds a new diaphragm, or modifies an existing diaphragm
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDiaphragm(
	string Name,
	bool SemiRigid
)
Function SetDiaphragm (
	Name As String,
	SemiRigid As Boolean
) As Integer
Dim instance As cDiaphragm
Dim Name As String
Dim SemiRigid As Boolean
Dim returnValue As Integer
returnValue = instance.SetDiaphragm(Name,
	SemiRigid)
int SetDiaphragm(
	String^ Name,
	bool SemiRigid
)
abstract SetDiaphragm :
        Name : string *
        SemiRigid : bool -> int
Parameters
Name
Type: System.String
 This is the name of a diaphragm. If this is the name of an existing diaphragm, that diaphragm is modified, otherwise a new diaphragm is added.
SemiRigid
Type: System.Boolean
 This item is True if the diaphragm is to be semi-rigid, and False otherwise
Return Value
Type: Int32
 Returns zero if the diaphragm is successfully added or modified, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberNames As Integer
   Dim MyName As String()
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new diaphragm
    ret = SapModel.Diaphragm.SetDiaphragm("MyDiaphragm1A", SemiRigid:=True)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDiaphragm Interface
ETABSv1 Namespace